tabakovKonstantin/zigbee-watermeter/sdkconfig.defaults
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=y
CONFIG_ESP_PHY_MAC_BB_PD=y
CONFIG_IEEE802154_SLEEP_ENABLE=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y
CONFIG_ZB_ENABLED=y
# CONFIG_ZB_ZCZR is not set
CONFIG_ZB_ZED=y
# CONFIG_ZB_DEBUG_MODE is not set
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_IDF_TARGET="esp32c6"
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_WATERMETER_SLEEP_MODE_DEEP=y
CONFIG_WATERMETER_SENSOR_GPIO=1
CONFIG_WATERMETER_SENSOR_DEBOUNCE_MS=1000
CONFIG_WATERMETER_PM_MAX_FREQ_160=y
CONFIG_WATERMETER_REPORT_INTERVAL_MS=3300000
CONFIG_WATERMETER_BATTERY_REPORT_INTERVAL_MS=21600000
CONFIG_WATERMETER_PULSE_GRACE_MS=30000
CONFIG_WATERMETER_DELIVERY_WINDOW_MS=10000
CONFIG_WATERMETER_REPORT_FLUSH_MS=500
CONFIG_WATERMETER_PARENT_POLL_INTERVAL_MS=1000
CONFIG_WATERMETER_OTA_POLL_INTERVAL_MS=500
CONFIG_WATERMETER_COMMISSIONING_WINDOW_MS=120000
CONFIG_WATERMETER_RETRY_FIRST_MS=300000
CONFIG_WATERMETER_RETRY_SECOND_MS=900000
CONFIG_WATERMETER_RETRY_THIRD_MS=1800000
CONFIG_WATERMETER_RETRY_MAX_MS=3300000
CONFIG_WATERMETER_ZIGBEE_TX_POWER_DBM=20
CONFIG_WATERMETER_ZIGBEE_KEEP_ALIVE_MS=3300000
CONFIG_WATERMETER_ZIGBEE_AGING_TIMEOUT_128MIN=y
CONFIG_WATERMETER_BATTERY_DIVIDER_TOP_OHM=200000
CONFIG_WATERMETER_BATTERY_DIVIDER_BOTTOM_OHM=200000
CONFIG_WATERMETER_BATTERY_EMPTY_MV=3300
CONFIG_WATERMETER_BATTERY_FULL_MV=4200
CONFIG_WATERMETER_BATTERY_ADC_SAMPLES=16
